# Module 1 - Manipulating data with Pandas
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by Austin Animal Center over several years and use our pandas skills from the last lecture and learn some new ones in order to explore this data further.

#### _Our goals today are to be able to_: <br/>

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use mean, min, max, and value_counts 
- Use apply and applymap to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a groupby object is and split a DataFrame using a groupby
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Let's take a moment to examine the [Austin Animal Center data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

## Switch gears

Before we answer those questions about the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [1]:
!pwd
!ls -al

/Users/jon/code/flatiron_datascience/github/dc_ds_04_22_19/module_1/day_4_lecture_1_manipulating_with_pandas
total 88
drwxr-xr-x   9 jon  staff    288 Apr 25 10:00 .
drwxr-xr-x  14 jon  staff    448 Apr 25 09:54 ..
drwxr-xr-x   2 jon  staff     64 Apr 25 10:00 .ipynb_checkpoints
-rw-r--r--   1 jon  staff     95 Apr 25 09:54 ds_chars.csv
-rw-r--r--   1 jon  staff  11328 Apr 25 09:54 heart.csv
drwxr-xr-x   4 jon  staff    128 Apr 25 09:54 images
-rw-r--r--   1 jon  staff  16603 Apr 25 09:54 manipulating_data_with_pandas.ipynb
-rw-r--r--   1 jon  staff   3297 Apr 25 09:54 pre_process_animal_shelter_data.py
-rw-r--r--   1 jon  staff    130 Apr 25 09:54 states.csv

In [4]:
import pandas as pd
uci = pd.read_csv('heart.csv')

In [3]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

In [5]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [6]:
uci.shape

(303, 14)

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [7]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.2 KB

In [8]:
# Call the .describe() method on our dataset. What do you observe?

uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [16]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [14]:
uci.mean()

age          54.366337
sex           0.683168
cp            0.966997
trestbps    131.623762
chol        246.264026
fbs           0.148515
restecg       0.528053
thalach     149.646865
exang         0.326733
oldpeak       1.039604
slope         1.399340
ca            0.729373
thal          2.313531
target        0.544554
dtype: float64

#### The Axis Variable

In [17]:
uci.sum() # Try [shift] + [tab] here!

age         16473.0
sex           207.0
cp            293.0
trestbps    39882.0
chol        74618.0
fbs            45.0
restecg       160.0
thalach     45343.0
exang          99.0
oldpeak       315.0
slope         424.0
ca            221.0
thal          701.0
target        165.0
dtype: float64

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [22]:
uci['age'].value_counts()[:10]

58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
60    11
56    11
Name: age, dtype: int64

$\bf{\rightarrow Exercise: What\ are\ the\ different\ values\ for\ restecg?}$

In [23]:
# Your code here!

uci['restecg'].value_counts()

1    152
0    147
2      4
Name: restecg, dtype: int64

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [24]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

Questions:
how many rows in this dataset?
which column has the most null values (missing data?)
what's the predominant data type in this file?
What are the breed value_counts? What's the top breed for adopted dogs?
How about top outcome counts for dogs?

In [58]:
print('row count  = '+str(animal_outcomes.shape[0]))

row count  = 98865

In [70]:
animal_outcomes.dtypes.value_counts()

object    12
dtype: int64

In [59]:
animal_outcomes.count

<bound method DataFrame.count of       Animal ID        Name                DateTime               MonthYear  \
0       A793392         NaN  04/24/2019 09:37:00 PM  04/24/2019 09:37:00 PM
1       A793087    *Jeepers  04/24/2019 07:04:00 PM  04/24/2019 07:04:00 PM
2       A793417     Diamond  04/24/2019 07:04:00 PM  04/24/2019 07:04:00 PM
3       A793416         NaN  04/24/2019 07:00:00 PM  04/24/2019 07:00:00 PM
4       A772415         Sky  04/24/2019 06:48:00 PM  04/24/2019 06:48:00 PM
5       A793162         NaN  04/24/2019 06:47:00 PM  04/24/2019 06:47:00 PM
6       A792860         NaN  04/24/2019 06:40:00 PM  04/24/2019 06:40:00 PM
7       A790254       Drake  04/24/2019 06:17:00 PM  04/24/2019 06:17:00 PM
8       A793150         NaN  04/24/2019 06:09:00 PM  04/24/2019 06:09:00 PM
9       A793329  *Grey Wind  04/24/2019 05:47:00 PM  04/24/2019 05:47:00 PM
10      A728768     *Woobie  04/24/2019 05:47:00 PM  04/24/2019 05:47:00 PM
11      A793185         NaN  04/24/2019 05:31:00 PM  04/24/2019 05:31:00 PM
12      A793376        Owen  04/24/2019 05:30:00 PM  04/24/2019 05:30:00 PM
13      A791264        Arlo  04/24/2019 05:17:00 PM  04/24/2019 05:17:00 PM
14      A771540   Big Sherm  04/24/2019 05:10:00 PM  04/24/2019 05:10:00 PM
15      A793160        Luna  04/24/2019 05:10:00 PM  04/24/2019 05:10:00 PM
16      A793309         NaN  04/24/2019 04:56:00 PM  04/24/2019 04:56:00 PM
17      A488234        Spot  04/24/2019 04:39:00 PM  04/24/2019 04:39:00 PM
18      A793310         NaN  04/24/2019 04:25:00 PM  04/24/2019 04:25:00 PM
19      A793307         NaN  04/24/2019 04:24:00 PM  04/24/2019 04:24:00 PM
20      A793161         NaN  04/24/2019 04:15:00 PM  04/24/2019 04:15:00 PM
21      A792748      Oliver  04/24/2019 03:12:00 PM  04/24/2019 03:12:00 PM
22      A793389         NaN  04/24/2019 02:33:00 PM  04/24/2019 02:33:00 PM
23      A766592        Coco  04/24/2019 02:25:00 PM  04/24/2019 02:25:00 PM
24      A793354         NaN  04/24/2019 01:49:00 PM  04/24/2019 01:49:00 PM
25      A793355         NaN  04/24/2019 01:49:00 PM  04/24/2019 01:49:00 PM
26      A793356         NaN  04/24/2019 01:49:00 PM  04/24/2019 01:49:00 PM
27      A793353         NaN  04/24/2019 01:49:00 PM  04/24/2019 01:49:00 PM
28      A793357         NaN  04/24/2019 01:49:00 PM  04/24/2019 01:49:00 PM
29      A793358         NaN  04/24/2019 01:49:00 PM  04/24/2019 01:49:00 PM
...         ...         ...                     ...                     ...
98835   A663887       Hooch  10/01/2013 03:07:00 PM  10/01/2013 03:07:00 PM
98836   A663935         NaN  10/01/2013 02:15:00 PM  10/01/2013 02:15:00 PM
98837   A663201        Buck  10/01/2013 02:14:00 PM  10/01/2013 02:14:00 PM
98838   A663955         NaN  10/01/2013 02:13:00 PM  10/01/2013 02:13:00 PM
98839   A664171      Knight  10/01/2013 01:59:00 PM  10/01/2013 01:59:00 PM
98840   A663938         NaN  10/01/2013 01:16:00 PM  10/01/2013 01:16:00 PM
98841   A664260         NaN  10/01/2013 01:00:00 PM  10/01/2013 01:00:00 PM
98842   A664261         NaN  10/01/2013 01:00:00 PM  10/01/2013 01:00:00 PM
98843   A664262         NaN  10/01/2013 12:59:00 PM  10/01/2013 12:59:00 PM
98844   A664263         NaN  10/01/2013 12:58:00 PM  10/01/2013 12:58:00 PM
98845   A664271         NaN  10/01/2013 12:57:00 PM  10/01/2013 12:57:00 PM
98846   A663495     Pikachu  10/01/2013 12:45:00 PM  10/01/2013 12:45:00 PM
98847   A664219         NaN  10/01/2013 12:34:00 PM  10/01/2013 12:34:00 PM
98848   A613553       Beast  10/01/2013 12:32:00 PM  10/01/2013 12:32:00 PM
98849   A664258      Sylvio  10/01/2013 12:27:00 PM  10/01/2013 12:27:00 PM
98850   A648744      Claire  10/01/2013 12:27:00 PM  10/01/2013 12:27:00 PM
98851   A663546       *Gage  10/01/2013 12:24:00 PM  10/01/2013 12:24:00 PM
98852   A664225         Lou  10/01/2013 12:13:00 PM  10/01/2013 12:13:00 PM
98853   A663342        Deco  10/01/2013 12:05:00 PM  10/01/2013 12:05:00 PM
98854   A656894        Jake  10/01/2013 11:53:00 AM  10/01/2013 11:53:00 AM
98855   A661795      Blakie  10/01/2013 11:53:00 AM  10/01/2013 11:53:00 AM
98856   A663833   Baby Girl  10/01/2013 11:50:00 AM  10/01/2013 11:50:00 AM
98857   A663572     *Starla  10/01/2013 11:42:00 AM  10/01/2013 11:42:00 AM
98858   A663888         NaN  10/01/2013 11:13:00 AM  10/01/2013 11:13:00 AM
98859   A663646         NaN  10/01/2013 11:12:00 AM  10/01/2013 11:12:00 AM
98860   A664223        Moby  10/01/2013 11:03:00 AM  10/01/2013 11:03:00 AM
98861   A664237         NaN  10/01/2013 10:44:00 AM  10/01/2013 10:44:00 AM
98862   A664236         NaN  10/01/2013 10:44:00 AM  10/01/2013 10:44:00 AM
98863   A664235         NaN  10/01/2013 10:39:00 AM  10/01/2013 10:39:00 AM
98864   A659834     *Dudley  10/01/2013 09:31:00 AM  10/01/2013 09:31:00 AM

      Date of Birth     Outcome Type Outcome Subtype Animal Type  \
0        04/22/2019         Transfer         Partner         Cat
1        04/19/2017         Adoption             NaN         Dog
2        04/24/2018  Return to Owner             NaN         Dog
3        02/24/2019       Euthanasia     Rabies Risk       Other
4        04/12/2018         Adoption          Foster         Dog
5        01/20/2019         Adoption             NaN         Dog
6        04/16/2014         Adoption             NaN         Dog
7        03/07/2017  Return to Owner             NaN         Dog
8        04/20/2017         Transfer             Snr         Cat
9        12/23/2018         Adoption             NaN         Dog
10       09/19/2015         Adoption          Foster         Dog
11       02/20/2019         Adoption             NaN         Dog
12       07/24/2015  Return to Owner             NaN         Dog
13       03/23/2018         Adoption             NaN         Cat
14       05/06/2010         Adoption          Foster         Dog
15       02/11/2019         Adoption             NaN         Dog
16       01/23/2019         Adoption             NaN         Cat
17       10/02/2005  Return to Owner             NaN         Dog
18       01/23/2019         Adoption             NaN         Cat
19       01/23/2019         Adoption             NaN         Cat
20       01/20/2019         Adoption             NaN         Dog
21       04/15/2017  Return to Owner             NaN         Cat
22       04/24/2018       Euthanasia       Suffering       Other
23       11/12/2016  Return to Owner             NaN         Dog
24       03/15/2019         Transfer         Partner         Cat
25       03/15/2019         Transfer         Partner         Cat
26       03/15/2019         Transfer         Partner         Cat
27       04/23/2017         Transfer         Partner         Cat
28       03/15/2019         Transfer         Partner         Cat
29       03/15/2019         Transfer         Partner         Cat
...             ...              ...             ...         ...
98835    09/25/2010       Euthanasia         Medical         Dog
98836    09/26/1999         Transfer         Partner         Dog
98837    09/14/2011         Transfer         Partner         Dog
98838    09/27/1999         Transfer         Partner         Dog
98839    12/30/2012  Return to Owner             NaN         Dog
98840    09/27/2003       Euthanasia       Suffering         Dog
98841    09/10/2013         Transfer         Partner         Cat
98842    09/10/2013         Transfer         Partner         Cat
98843    09/22/2013         Transfer         Partner         Cat
98844    09/22/2013         Transfer         Partner         Cat
98845    09/24/2013         Transfer         Partner         Cat
98846    05/19/2013  Return to Owner             NaN         Cat
98847    08/08/2013             Died       In Kennel         Cat
98848    05/06/2010  Return to Owner             NaN         Dog
98849    10/01/2006  Return to Owner             NaN         Dog
98850    03/04/2012  Return to Owner             NaN         Dog
98851    09/20/2011       Euthanasia      Aggressive         Dog
98852    09/30/2010  Return to Owner             NaN         Dog
98853    09/17/2012       Euthanasia        Behavior         Dog
98854    04/22/2013         Adoption             NaN         Cat
98855    03/25/2013         Adoption             NaN         Cat
98856    09/24/2004  Return to Owner             NaN         Dog
98857    09/21/2010         Adoption             NaN         Dog
98858    09/25/2011         Transfer         Partner         Dog
98859    09/22/2010         Transfer         Partner         Dog
98860    09/30/2009  Return to Owner             NaN         Dog
98861    09/24/2013         Transfer         Partner         Cat
98862    09/24/2013         Transfer         Partner         Cat
98863    09/24/2013         Transfer         Partner         Cat
98864    07/23/2013         Adoption          Foster         Dog

      Sex upon Outcome Age upon Outcome                               Breed  \
0          Intact Male           2 days              Domestic Shorthair Mix
1        Neutered Male          2 years                         Harrier Mix
2        Spayed Female           1 year                        Pit Bull Mix
3              Unknown              NaN                         Raccoon Mix
4        Spayed Female           1 year                   Border Collie Mix
5        Neutered Male         3 months                         Harrier Mix
6        Neutered Male          5 years             Chihuahua Shorthair Mix
7          Intact Male          2 years                      Cane Corso Mix
8          Intact Male          2 years               Domestic Longhair Mix
9        Neutered Male         4 months                 Anatol Shepherd Mix
10       Neutered Male          3 years              Labrador Retriever Mix
11       Spayed Female         2 months                        Pit Bull Mix
12         Intact Male          3 years                          Beagle Mix
13       Neutered Male           1 year              Domestic Shorthair Mix
14       Neutered Male          8 years      Staffordshire/American Bulldog
15       Spayed Female         2 months                            Pbgv Mix
16       Neutered Male         2 months                         Siamese Mix
17       Neutered Male         13 years  German Shepherd/Labrador Retriever
18       Spayed Female         2 months                         Siamese Mix
19       Spayed Female         2 months                         Siamese Mix
20       Spayed Female         3 months                       Blue Lacy Mix
21       Neutered Male          2 years              Domestic Shorthair Mix
22             Unknown           1 year                         Raccoon Mix
23         Intact Male          2 years             Chihuahua Shorthair Mix
24       Intact Female          1 month              Domestic Shorthair Mix
25       Intact Female          1 month              Domestic Shorthair Mix
26         Intact Male          1 month              Domestic Shorthair Mix
27       Intact Female          2 years              Domestic Shorthair Mix
28         Intact Male          1 month              Domestic Shorthair Mix
29       Intact Female          1 month              Domestic Shorthair Mix
...                ...              ...                                 ...
98835    Neutered Male          3 years                        Pit Bull Mix
98836      Intact Male         14 years             Chihuahua Shorthair Mix
98837    Neutered Male          2 years                        Pit Bull Mix
98838    Intact Female         14 years             Chihuahua Shorthair Mix
98839    Neutered Male         9 months                    Basset Hound Mix
98840    Neutered Male         10 years       Rottweiler/Labrador Retriever
98841    Intact Female          3 weeks              Domestic Shorthair Mix
98842    Intact Female          3 weeks              Domestic Shorthair Mix
98843      Intact Male          1 weeks              Domestic Shorthair Mix
98844      Intact Male          1 weeks              Domestic Shorthair Mix
98845    Intact Female           1 week              Domestic Shorthair Mix
98846    Spayed Female         4 months              Domestic Shorthair Mix
98847      Intact Male          1 month              Domestic Shorthair Mix
98848    Neutered Male          3 years                        Pit Bull Mix
98849    Neutered Male          7 years                      Weimaraner Mix
98850    Spayed Female           1 year                 Anatol Shepherd Mix
98851    Neutered Male          2 years                American Bulldog Mix
98852    Neutered Male          3 years                        Shih Tzu Mix
98853    Neutered Male           1 year                  Chesa Bay Retr Mix
98854    Neutered Male         5 months              Domestic Shorthair Mix
98855    Spayed Female         6 months              Domestic Shorthair Mix
98856    Spayed Female          9 years              Labrador Retriever Mix
98857    Spayed Female          3 years                 Anatol Shepherd Mix
98858    Spayed Female          2 years                           Boxer Mix
98859    Neutered Male          3 years                      Toy Poodle Mix
98860    Neutered Male          4 years                         Bulldog Mix
98861          Unknown           1 week              Domestic Shorthair Mix
98862          Unknown           1 week              Domestic Shorthair Mix
98863          Unknown           1 week              Domestic Shorthair Mix
98864    Neutered Male         2 months              Labrador Retriever Mix

                     Color
0              White/Black
1           Black/Tricolor
2          Chocolate/White
3              Black/White
4                    Sable
5                 Tricolor
6                    Brown
7            Brown Brindle
8              Black/White
9                Tan/Black
10             Black/White
11           Brown Brindle
12                Tricolor
13             Black/White
14             White/Brown
15             Black/Brown
16        Lynx Point/White
17             Brown/Black
18        Lynx Point/White
19        Lynx Point/White
20              Blue/White
21             Brown Tabby
22              Black/Gray
23               Tan/Brown
24                  Tortie
25            Tortie/White
26             Cream Tabby
27      Orange Tabby/White
28            Orange Tabby
29             Blue/Tortie
...                    ...
98835            Red/White
98836                Brown
98837          Brown/White
98838            Black/Tan
98839                Black
98840            Black/Tan
98841          Black/White
98842               Tortie
98843         Orange Tabby
98844         Orange Tabby
98845         Orange Tabby
98846               Torbie
98847           Blue/White
98848          Black/White
98849               Silver
98850       White/Tricolor
98851  White/Brown Brindle
98852           Gray/White
98853            Red/White
98854                Black
98855               Tortie
98856                Black
98857          White/Brown
98858            Red/White
98859                White
98860                White
98861         Orange/White
98862         Orange/White
98863         Orange/White
98864                Black

[98865 rows x 12 columns]>

In [29]:
# put your code here

animal_outcomes.info()
print(animal_outcomes.shape)
print(animal_outcomes.dtypes)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98865 entries, 0 to 98864
Data columns (total 12 columns):
Animal ID           98865 non-null object
Name                68333 non-null object
DateTime            98865 non-null object
MonthYear           98865 non-null object
Date of Birth       98865 non-null object
Outcome Type        98856 non-null object
Outcome Subtype     44828 non-null object
Animal Type         98865 non-null object
Sex upon Outcome    98863 non-null object
Age upon Outcome    98862 non-null object
Breed               98865 non-null object
Color               98865 non-null object
dtypes: object(12)
memory usage: 9.1+ MB
(98865, 12)
Animal ID           object
Name                object
DateTime            object
MonthYear           object
Date of Birth       object
Outcome Type        object
Outcome Subtype     object
Animal Type         object
Sex upon Outcome    object
Age upon Outcome    object
Breed               object
Color               object
dtype: object

In [79]:
#what are the breed value_counts
#what is top breed
breedcounts = animal_outcomes['Breed'].value_counts()
countofbreeds = len(breedcounts)
print(breedcounts[:10])
print('\n'+'unique breeds ='+str(countofbreeds))
print('\n'+'top breed is '+ str(breedcounts.index[0]))

Domestic Shorthair Mix       29090
Pit Bull Mix                  7738
Labrador Retriever Mix        5990
Chihuahua Shorthair Mix       5861
Domestic Medium Hair Mix      2935
German Shepherd Mix           2604
Bat Mix                       1735
Domestic Longhair Mix         1452
Australian Cattle Dog Mix     1315
Siamese Mix                   1160
Name: Breed, dtype: int64

unique breeds =2396

top breed is Domestic Shorthair Mix

In [55]:
dog_outcomes = animal_outcomes[animal_outcomes['Animal Type'] =='Dog']
dog_outcomes['Outcome Type'].value_counts()

Adoption           26207
Return to Owner    16175
Transfer           12134
Euthanasia          1602
Rto-Adopt            302
Died                 192
Missing               20
Disposal              11
Name: Outcome Type, dtype: int64

In [81]:
adopteddogs = animal_outcomes[(animal_outcomes['Animal Type'] =='Dog') & (animal_outcomes['Outcome Type'] =='Adoption')]
adopteddogs['Breed'].value_counts()

Labrador Retriever Mix                      3016
Pit Bull Mix                                2986
Chihuahua Shorthair Mix                     2790
German Shepherd Mix                         1315
Australian Cattle Dog Mix                    735
Dachshund Mix                                465
Border Collie Mix                            440
Boxer Mix                                    389
Catahoula Mix                                324
Staffordshire Mix                            315
Miniature Poodle Mix                         312
Australian Shepherd Mix                      284
Jack Russell Terrier Mix                     268
Siberian Husky Mix                           261
Cairn Terrier Mix                            256
Rat Terrier Mix                              254
Pointer Mix                                  245
Chihuahua Longhair Mix                       236
Yorkshire Terrier Mix                        223
Beagle Mix                                   215
Anatol Shepherd Mix                          214
Black Mouth Cur Mix                          207
Great Pyrenees Mix                           206
Miniature Schnauzer Mix                      202
Plott Hound Mix                              194
American Bulldog Mix                         173
Australian Kelpie Mix                        172
Chihuahua Shorthair/Dachshund                162
Rottweiler Mix                               146
German Shepherd                              132
                                            ...
Silky Terrier/Maltese                          1
Great Pyrenees/English Setter                  1
Boxer/Boston Terrier                           1
Airedale Terrier/Miniature Schnauzer           1
Australian Shepherd/Great Pyrenees             1
Welsh Springer Spaniel                         1
Boxer/Australian Kelpie                        1
Beagle/Chihuahua Longhair                      1
Redbone Hound/Boxer                            1
Shih Tzu/Chihuahua Longhair                    1
Bull Terrier/Australian Kelpie                 1
Miniature Pinscher/Australian Cattle Dog       1
Dalmatian/Boxer                                1
Boston Terrier/Pug                             1
Jack Russell Terrier/Brittany                  1
American Bulldog/Blue Lacy                     1
Chihuahua Shorthair/Affenpinscher              1
Chihuahua Longhair/Silky Terrier               1
English Pointer/Boxer                          1
Cairn Terrier/Scottish Terrier                 1
Manchester Terrier/Chihuahua Longhair          1
Dachshund Wirehair/Pbgv                        1
Black Mouth Cur/Staffordshire                  1
Dandie Dinmont                                 1
Shetland Sheepdog/Dachshund Longhair           1
Australian Cattle Dog/Queensland Heeler        1
Newfoundland/Queensland Heeler                 1
American Pit Bull Terrier/Pointer              1
Harrier/Labrador Retriever                     1
Cocker Spaniel/Dachshund                       1
Name: Breed, Length: 1551, dtype: int64

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [82]:
def successor(x):
    return x + 1

In [83]:
uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [84]:
uci['age'].map(successor).tail(10)

293    68
294    45
295    64
296    64
297    60
298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [85]:
uci['oldpeak'].map(lambda x: round(x))[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

$\bf{\rightarrow Exercise: Use\ an\ anonymous\ function\ to\ turn\ the\ entries\ in\ age\ to\ strings}$

In [87]:
# Your code here!

uci['age'].map(lambda x: str(x))[:3]

0    63
1    37
2    41
Name: age, dtype: object

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [120]:
rawdf = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [121]:
animal_outcomes = rawdf

In [122]:

new_names = ['id', 'name', 'date', 'monthyear', 'dob', 'outcome', 'outcome_s', 'animal', 'sex', 'age', 'breed', 'color']
animal_outcomes.columns = new_names

In [123]:
# Your code here

animal_outcomes.date  = animal_outcomes['date'].map(lambda x: x[:10])

In [124]:
animal_outcomes['date'] =  pd.to_datetime(animal_outcomes['date'], format='%m/%d/%Y')
animal_outcomes['dob'] =  pd.to_datetime(animal_outcomes['dob'], format='%m/%d/%Y')

In [128]:
animal_outcomes['age_in_days']  = animal_outcomes['date']-animal_outcomes['dob']
animal_outcomes['years_old'] = animal_outcomes['age_in_days'].map(lambda x: x.days/365)
animal_outcomes.dtypes

id                      object
name                    object
date            datetime64[ns]
monthyear               object
dob             datetime64[ns]
outcome                 object
outcome_s               object
animal                  object
sex                     object
age                     object
breed                   object
color                   object
age_in_days    timedelta64[ns]
years_old              float64
dtype: object

In [129]:
animal_outcomes.head()

,id,name,date,monthyear,dob,outcome,outcome_s,animal,sex,age,breed,color,age_in_days,years_old
0,A792769,Pawd Father,2019-04-25,04/25/2019 08:22:00 AM,2017-04-15,Return to Owner,NaN,Cat,Intact Male,2 years,Domestic Shorthair Mix,Black,740 days,2.027397
1,A791077,*Archie,2019-04-25,04/25/2019 08:07:00 AM,2019-02-14,Adoption,Foster,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Orange Tabby,70 days,0.191781
2,A793392,NaN,2019-04-24,04/24/2019 09:37:00 PM,2019-04-22,Transfer,Partner,Cat,Intact Male,2 days,Domestic Shorthair Mix,White/Black,2 days,0.005479
3,A793417,Diamond,2019-04-24,04/24/2019 07:04:00 PM,2018-04-24,Return to Owner,NaN,Dog,Spayed Female,1 year,Pit Bull Mix,Chocolate/White,365 days,1.000000
4,A793087,*Jeepers,2019-04-24,04/24/2019 07:04:00 PM,2017-04-19,Adoption,NaN,Dog,Neutered Male,2 years,Harrier Mix,Black/Tricolor,735 days,2.013699

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [130]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [141]:
uci.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [144]:
uci.groupby('sex').get_group(0).tail()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
289,55,0,0,128,205,0,2,130,1,2.0,1,1,3,0
292,58,0,0,170,225,1,0,146,1,2.8,1,2,1,0
296,63,0,0,124,197,0,1,136,1,0.0,1,0,2,0
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

### Aggregating

In [134]:
uci.groupby('sex').std()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,9.409396,0.972427,19.311119,65.088946,0.332455,0.557150,20.047969,0.422503,1.119844,0.593736,0.881026,0.441290,0.435286
1,8.883803,1.059064,16.658246,42.782392,0.366955,0.510754,24.130882,0.484505,1.174632,0.627378,1.074082,0.659949,0.498626

$\bf{\rightarrow Exercise: Tell\ me\ the\ average\ cholesterol\ level\ for\ those\ with\ heart\ disease.}$

In [137]:
# Your code here!

uci[uci['target']==1]['chol'].mean()

242.23030303030302

### Apply to Animal Shelter Data

Lastly, use a groupby to show the average age of the different kinds of animal types. Hint: use `.unique()` on a column to see what unique values are in the column.

In [145]:
# Your code here
animal_outcomes.groupby('animal').mean()

           years_old
animal
Bird        1.408857
Cat         1.505504
Dog         2.815750
Livestock   1.193242
Other       1.272231

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [146]:
uci.pivot(values = 'sex', columns = 'target').tail(10)

target    0   1
293     1.0 NaN
294     1.0 NaN
295     1.0 NaN
296     0.0 NaN
297     1.0 NaN
298     0.0 NaN
299     1.0 NaN
300     1.0 NaN
301     1.0 NaN
302     0.0 NaN

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [147]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [148]:
toy1.join(toy2.set_index('age'), on = 'age',
          lsuffix = '_A', rsuffix = '_B').head()

   age  HP_A  HP_B
0   63   142   100
1   33    47   200

### `.merge()`

In [149]:
ds_chars = pd.read_csv('ds_chars.csv', index_col = 0)

In [150]:
states = pd.read_csv('states.csv', index_col = 0)

In [151]:
ds_chars.merge(states, left_on='home_state', right_on = 'state',
               how = 'inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

### `pd.concat()`

$\bf{\rightarrow Exercise: Look\ up\ the documentation\ on\ pd.concat}$ (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) $\bf{and\ use\ it\ to\ concatenate\ ds\_chars\ and\ states.}$
<br/>
$\bf{Your\ result\ should\ still\ have\ only\ five\ rows!}$

In [152]:
pd.concat([ds_chars, states])

/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      HP     capital home_state    name   nickname state
0  200.0         NaN         WA    greg        NaN   NaN
1  200.0         NaN         WA   miles        NaN   NaN
2  170.0         NaN         TX    alan        NaN   NaN
3  300.0         NaN         DC  alison        NaN   NaN
4  200.0         NaN         TX  rachel        NaN   NaN
0    NaN     Olympia        NaN     NaN  evergreen    WA
1    NaN      Austin        NaN     NaN      alamo    TX
2    NaN  Washington        NaN     NaN   district    DC
3    NaN    Columbus        NaN     NaN    buckeye    OH
4    NaN       Salem        NaN     NaN     beaver    OR

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [153]:
pd.melt(ds_full, id_vars=)

SyntaxError: invalid syntax (<ipython-input-153-da7513d8930c>, line 1)

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

The Url for the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

_Hints_ :
- import and clean the intake dataset first
- use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days-in-shelter variable
- Notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- Use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. We will use it in a later lecture!

use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here

## Assessment & Reflection